
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2024.1.163.4.11
# Date: 2024-11-17 23:17

# Copyright (C) 2013 - 2024 Efinix Inc. All rights reserved.

# Device: Ti180J484
# Project: mem_test
# Timing Model: I4 (final)

# PLL Constraints
#################


create_clock -period 13.468 -name pll_inst1_CLKOUT0 [get_ports {pll_inst1_CLKOUT0}]
create_clock -period 200.337 -name CLK_5M [get_ports {CLK_5M}]
create_clock -period 37.037 -name mipi0_ref_clk [get_ports {mipi0_ref_clk}]
create_clock -period 5.000 -name pll_inst2_CLKOUT0 [get_ports {pll_inst2_CLKOUT0}]
create_clock -period 5.000 -name axi0_ACLK [get_ports {axi0_ACLK}]
create_clock -period 40.000 -name i_fb_clk [get_ports {i_fb_clk}]
create_clock -waveform {1.000 2.000} -period 2.000 -name mipi_dphy_tx_FASTCLK_C [get_ports {mipi_dphy_tx_FASTCLK_C}]
create_clock -waveform {0.500 1.500} -period 2.000 -name mipi_dphy_tx_FASTCLK_D [get_ports {mipi_dphy_tx_FASTCLK_D}]
create_clock -period 8.000 -name mipi_dphy_tx_SLOWCLK [get_ports {mipi_dphy_tx_SLOWCLK}]
create_clock -period 10.000 -name mipi_clk [get_ports {mipi_clk}]
create_clock -period 14.286 -name i_sysclk_div2 [get_ports {i_sysclk_div2}]
create_clock -period 7.143 -name hdmi_tx_slow_clk [get_ports {hdmi_tx_slow_clk}]
create_clock -waveform {0.357 1.072} -period 1.429 -name hdmi_tx_fast_clk [get_ports {hdmi_tx_fast_clk}]

set_clock_groups -asynchronous -group {axi0_ACLK} -group {i_sys_clk}
set_clock_groups -asynchronous -group {dphy_byte_clk} -group {i_sysclk_div2} -group {mipi_dphy_rx_inst1_byte_clk} -group {i_sys_clk}
set_clock_groups -asynchronous -group {i_sysclk_div2} -group {i_fb_clk} -group {axi0_ACLK} -group {mipi_dphy_rx_inst1_byte_clk}
set_clock_groups -asynchronous -group {i_sys_clk} -group {axi1_ACLK} 
set_clock_groups -asynchronous -group {mipi_dphy_rx_inst1_byte_clk} -group {CLK_5M} 
set_clock_groups -asynchronous -group {mipi_dphy_rx_inst1_byte_clk} -group {mipi_clk} 
#set_clock_groups -asynchronous -group {mipi_dphy_rx_inst1_byte_clk} -group {i_sysclk_div2}   

# GPIO Constraints
####################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lcd_power_en}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lcd_power_en}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {o_lcd_rstn}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {o_lcd_rstn}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_scl_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_scl_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_scl_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_scl_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_scl_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_scl_OE}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_sda_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_sda_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_sda_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_sda_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_sda_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_sda_OE}]


# MIPI RX Lane Constraints
############################
 create_clock -period 10.000 -name mipi_rx_ck0_CLKOUT [get_ports {mipi_rx_ck0_CLKOUT}]
 create_clock -period 10.000 -name mipi_rx_ck1_CLKOUT [get_ports {mipi_rx_ck1_CLKOUT}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -max 1.414 [get_ports {mipi_rx_dp00_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -min -0.006 [get_ports {mipi_rx_dp00_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -max 1.172 [get_ports {mipi_rx_dp00_RST}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -min -0.216 [get_ports {mipi_rx_dp00_RST}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -max 1.675 [get_ports {mipi_rx_dp00_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -min 0.654 [get_ports {mipi_rx_dp00_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -max 1.511 [get_ports {mipi_rx_dp00_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~25~963}] -min 0.559 [get_ports {mipi_rx_dp00_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -max 1.414 [get_ports {mipi_rx_dp01_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -min -0.006 [get_ports {mipi_rx_dp01_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -max 1.172 [get_ports {mipi_rx_dp01_RST}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -min -0.216 [get_ports {mipi_rx_dp01_RST}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -max 1.675 [get_ports {mipi_rx_dp01_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -min 0.654 [get_ports {mipi_rx_dp01_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -max 1.511 [get_ports {mipi_rx_dp01_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~8~964}] -min 0.559 [get_ports {mipi_rx_dp01_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -max 1.414 [get_ports {mipi_rx_dp02_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -min -0.006 [get_ports {mipi_rx_dp02_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -max 1.172 [get_ports {mipi_rx_dp02_RST}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -min -0.216 [get_ports {mipi_rx_dp02_RST}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -max 1.675 [get_ports {mipi_rx_dp02_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -min 0.654 [get_ports {mipi_rx_dp02_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -max 1.511 [get_ports {mipi_rx_dp02_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~20~963}] -min 0.559 [get_ports {mipi_rx_dp02_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -max 1.414 [get_ports {mipi_rx_dp03_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -min -0.006 [get_ports {mipi_rx_dp03_FIFO_RD}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -max 1.172 [get_ports {mipi_rx_dp03_RST}]
set_output_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -min -0.216 [get_ports {mipi_rx_dp03_RST}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -max 1.675 [get_ports {mipi_rx_dp03_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -min 0.654 [get_ports {mipi_rx_dp03_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -max 1.511 [get_ports {mipi_rx_dp03_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck0_CLKOUT -reference_pin [get_ports {mipi_rx_ck0_CLKOUT~CLKOUT~11~963}] -min 0.559 [get_ports {mipi_rx_dp03_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -max 1.414 [get_ports {mipi_rx_dp10_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -min -0.006 [get_ports {mipi_rx_dp10_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -max 1.172 [get_ports {mipi_rx_dp10_RST}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -min -0.216 [get_ports {mipi_rx_dp10_RST}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -max 1.675 [get_ports {mipi_rx_dp10_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -min 0.654 [get_ports {mipi_rx_dp10_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -max 1.511 [get_ports {mipi_rx_dp10_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~32~963}] -min 0.559 [get_ports {mipi_rx_dp10_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -max 1.414 [get_ports {mipi_rx_dp11_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -min -0.006 [get_ports {mipi_rx_dp11_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -max 1.172 [get_ports {mipi_rx_dp11_RST}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -min -0.216 [get_ports {mipi_rx_dp11_RST}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -max 1.675 [get_ports {mipi_rx_dp11_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -min 0.654 [get_ports {mipi_rx_dp11_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -max 1.511 [get_ports {mipi_rx_dp11_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~51~963}] -min 0.559 [get_ports {mipi_rx_dp11_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -max 1.414 [get_ports {mipi_rx_dp12_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -min -0.006 [get_ports {mipi_rx_dp12_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -max 1.172 [get_ports {mipi_rx_dp12_RST}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -min -0.216 [get_ports {mipi_rx_dp12_RST}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -max 1.675 [get_ports {mipi_rx_dp12_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -min 0.654 [get_ports {mipi_rx_dp12_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -max 1.511 [get_ports {mipi_rx_dp12_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~29~964}] -min 0.559 [get_ports {mipi_rx_dp12_HS_IN[*]}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -max 1.414 [get_ports {mipi_rx_dp13_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -min -0.006 [get_ports {mipi_rx_dp13_FIFO_RD}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -max 1.172 [get_ports {mipi_rx_dp13_RST}]
set_output_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -min -0.216 [get_ports {mipi_rx_dp13_RST}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -max 1.675 [get_ports {mipi_rx_dp13_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -min 0.654 [get_ports {mipi_rx_dp13_FIFO_EMPTY}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -max 1.511 [get_ports {mipi_rx_dp13_HS_IN[*]}]
set_input_delay -clock mipi_rx_ck1_CLKOUT -reference_pin [get_ports {mipi_rx_ck1_CLKOUT~CLKOUT~42~963}] -min 0.559 [get_ports {mipi_rx_dp13_HS_IN[*]}]

# MIPI TX Lane Constraints
############################
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~109~964}] -max 0.898 [get_ports {mipi_tx_ck0_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~109~964}] -min -0.109 [get_ports {mipi_tx_ck0_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~109~964}] -max 0.826 [get_ports {mipi_tx_ck0_RST}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~109~964}] -min -0.109 [get_ports {mipi_tx_ck0_RST}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~147~964}] -max 0.898 [get_ports {mipi_tx_ck1_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~147~964}] -min -0.109 [get_ports {mipi_tx_ck1_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~147~964}] -max 0.826 [get_ports {mipi_tx_ck1_RST}]
set_output_delay -clock mipi_dphy_tx_FASTCLK_D -reference_pin [get_ports {mipi_dphy_tx_FASTCLK_D~CLKOUT~147~964}] -min -0.109 [get_ports {mipi_tx_ck1_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~143~963}] -max 0.898 [get_ports {mipi_tx_dp00_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~143~963}] -min -0.109 [get_ports {mipi_tx_dp00_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~143~963}] -max 0.826 [get_ports {mipi_tx_dp00_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~143~963}] -min -0.109 [get_ports {mipi_tx_dp00_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~135~964}] -max 0.898 [get_ports {mipi_tx_dp01_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~135~964}] -min -0.109 [get_ports {mipi_tx_dp01_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~135~964}] -max 0.826 [get_ports {mipi_tx_dp01_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~135~964}] -min -0.109 [get_ports {mipi_tx_dp01_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~124~963}] -max 0.898 [get_ports {mipi_tx_dp02_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~124~963}] -min -0.109 [get_ports {mipi_tx_dp02_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~124~963}] -max 0.826 [get_ports {mipi_tx_dp02_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~124~963}] -min -0.109 [get_ports {mipi_tx_dp02_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~118~963}] -max 0.898 [get_ports {mipi_tx_dp03_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~118~963}] -min -0.109 [get_ports {mipi_tx_dp03_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~118~963}] -max 0.826 [get_ports {mipi_tx_dp03_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~118~963}] -min -0.109 [get_ports {mipi_tx_dp03_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~185~963}] -max 0.898 [get_ports {mipi_tx_dp10_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~185~963}] -min -0.109 [get_ports {mipi_tx_dp10_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~185~963}] -max 0.826 [get_ports {mipi_tx_dp10_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~185~963}] -min -0.109 [get_ports {mipi_tx_dp10_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~157~963}] -max 0.898 [get_ports {mipi_tx_dp11_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~157~963}] -min -0.109 [get_ports {mipi_tx_dp11_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~157~963}] -max 0.826 [get_ports {mipi_tx_dp11_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~157~963}] -min -0.109 [get_ports {mipi_tx_dp11_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~208~963}] -max 0.898 [get_ports {mipi_tx_dp12_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~208~963}] -min -0.109 [get_ports {mipi_tx_dp12_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~208~963}] -max 0.826 [get_ports {mipi_tx_dp12_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~208~963}] -min -0.109 [get_ports {mipi_tx_dp12_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~198~963}] -max 0.898 [get_ports {mipi_tx_dp13_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~198~963}] -min -0.109 [get_ports {mipi_tx_dp13_HS_OUT[*]}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~198~963}] -max 0.826 [get_ports {mipi_tx_dp13_RST}]
set_output_delay -clock mipi_dphy_tx_SLOWCLK -reference_pin [get_ports {mipi_dphy_tx_SLOWCLK~CLKOUT~198~963}] -min -0.109 [get_ports {mipi_tx_dp13_RST}]


# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> -name jtag_inst1_TCK [get_ports {jtag_inst1_TCK}]
set_output_delay -clock jtag_inst1_TCK -max 1.387 [get_ports {jtag_inst1_TDO}]
set_output_delay -clock jtag_inst1_TCK -min 0.555 [get_ports {jtag_inst1_TDO}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.603 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.282 [get_ports {jtag_inst1_CAPTURE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 1.191 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.682 [get_ports {jtag_inst1_RESET}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.593 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.344 [get_ports {jtag_inst1_SEL}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.564 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.362 [get_ports {jtag_inst1_UPDATE}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.575 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.294 [get_ports {jtag_inst1_SHIFT}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -max 1.416 [get_ports {jtag_inst1_DRCK}]
set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.884 [get_ports {jtag_inst1_DRCK}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> -name jtag_inst1_DRCK [get_ports {jtag_inst1_DRCK}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -max 0.626 [get_ports {jtag_inst1_RUNTEST}]
# set_input_delay -clock_fall -clock jtag_inst1_TCK -min 0.332 [get_ports {jtag_inst1_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {jtag_inst1_TCK jtag_inst1_DRCK}

# DDR Constraints
#####################
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 3.675 [get_ports {axi0_ARESETn}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.000 [get_ports {axi0_ARESETn}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARBURST[1] axi0_ARBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARBURST[1] axi0_ARBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARSIZE[2] axi0_ARSIZE[1] axi0_ARSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARSIZE[2] axi0_ARSIZE[1] axi0_ARSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_ARQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_ARQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWADDR[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.350 [get_ports {axi0_AWAPCMD}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWALLSTRB}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWALLSTRB}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWBURST[1] axi0_AWBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWBURST[1] axi0_AWBURST[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWCOBUF}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWCOBUF}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWID[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWLEN[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWSIZE[2] axi0_AWSIZE[1] axi0_AWSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWSIZE[2] axi0_AWSIZE[1] axi0_AWSIZE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWLOCK}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWCACHE[3] axi0_AWCACHE[2] axi0_AWCACHE[1] axi0_AWCACHE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWCACHE[3] axi0_AWCACHE[2] axi0_AWCACHE[1] axi0_AWCACHE[0]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_AWQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_AWQOS}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_BREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_BREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_RREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_RREADY}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WDATA[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WDATA[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WLAST}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WLAST}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WSTRB[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WSTRB[*]}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.310 [get_ports {axi0_WVALID}]
set_output_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min -0.140 [get_ports {axi0_WVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_ARREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_ARREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.520 [get_ports {axi0_AWREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.680 [get_ports {axi0_AWREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.520 [get_ports {axi0_BID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.680 [get_ports {axi0_BID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_BRESP[1] axi0_BRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_BRESP[1] axi0_BRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_BVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_BVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RDATA[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RDATA[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RID[*]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RLAST}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RLAST}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RRESP[1] axi0_RRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RRESP[1] axi0_RRESP[0]}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_RVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_RVALID}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -max 2.625 [get_ports {axi0_WREADY}]
set_input_delay -clock axi0_ACLK -reference_pin [get_ports {axi0_ACLK~CLKOUT~2~150}] -min 1.750 [get_ports {axi0_WREADY}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 3.675 [get_ports {axi1_ARESETn}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.000 [get_ports {axi1_ARESETn}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARADDR[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARADDR[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARAPCMD}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARAPCMD}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARBURST[1] axi1_ARBURST[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARBURST[1] axi1_ARBURST[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARID[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARID[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARLEN[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARLEN[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARSIZE[2] axi1_ARSIZE[1] axi1_ARSIZE[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARSIZE[2] axi1_ARSIZE[1] axi1_ARSIZE[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARVALID}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARVALID}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARLOCK}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARLOCK}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_ARQOS}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_ARQOS}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWADDR[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWADDR[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWAPCMD}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.350 [get_ports {axi1_AWAPCMD}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWALLSTRB}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWALLSTRB}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWBURST[1] axi1_AWBURST[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWBURST[1] axi1_AWBURST[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWCOBUF}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWCOBUF}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWID[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWID[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWLEN[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWLEN[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWSIZE[2] axi1_AWSIZE[1] axi1_AWSIZE[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWSIZE[2] axi1_AWSIZE[1] axi1_AWSIZE[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWVALID}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWVALID}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWLOCK}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWLOCK}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWCACHE[3] axi1_AWCACHE[2] axi1_AWCACHE[1] axi1_AWCACHE[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWCACHE[3] axi1_AWCACHE[2] axi1_AWCACHE[1] axi1_AWCACHE[0]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_AWQOS}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_AWQOS}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_BREADY}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_BREADY}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_RREADY}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_RREADY}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_WDATA[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_WDATA[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_WLAST}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_WLAST}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_WSTRB[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_WSTRB[*]}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.310 [get_ports {axi1_WVALID}]
set_output_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min -0.140 [get_ports {axi1_WVALID}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_ARREADY}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_ARREADY}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.520 [get_ports {axi1_AWREADY}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.680 [get_ports {axi1_AWREADY}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.520 [get_ports {axi1_BID[*]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.680 [get_ports {axi1_BID[*]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_BRESP[1] axi1_BRESP[0]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_BRESP[1] axi1_BRESP[0]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_BVALID}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_BVALID}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_RDATA[*]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_RDATA[*]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_RID[*]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_RID[*]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_RLAST}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_RLAST}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_RRESP[1] axi1_RRESP[0]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_RRESP[1] axi1_RRESP[0]}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_RVALID}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_RVALID}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -max 2.625 [get_ports {axi1_WREADY}]
set_input_delay -clock axi1_ACLK -reference_pin [get_ports {axi1_ACLK~CLKOUT~1~338}] -min 1.750 [get_ports {axi1_WREADY}]

# HSIO GPIO Constraints
#########################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {i_sw[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {i_sw[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {i_sw[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {i_sw[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {o_cam_rst_p}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {o_cam_rst_p}]

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {pll_inst1_CLKOUT0}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {pll_inst1_CLKOUT0}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {axi0_ACLK}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {axi0_ACLK}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {axi1_ACLK}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {axi1_ACLK}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {i_sys_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {i_sys_clk}]
# set_clock_latency -source -setup <pll_clk_latency_i_fb_clk_max + 2.385> [get_ports {mipi_clk}]
# set_clock_latency -source -hold <pll_clk_latency_i_fb_clk_min + 1.544> [get_ports {mipi_clk}]
# set_clock_latency -source -setup <pll_clk_latency_i_fb_clk_max + 2.385> [get_ports {i_sysclk_div2}]
# set_clock_latency -source -hold <pll_clk_latency_i_fb_clk_min + 1.544> [get_ports {i_sysclk_div2}]
# set_clock_latency -source -setup <pll_clk_latency_i_fb_clk_max + 2.385> [get_ports {CLK_5M}]
# set_clock_latency -source -hold <pll_clk_latency_i_fb_clk_min + 1.544> [get_ports {CLK_5M}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {i_fb_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {i_fb_clk}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {dphy_byte_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {dphy_byte_clk}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {esc_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {esc_clk}]
# set_clock_latency -source -setup <board_max + 0.828> [get_ports {mipi_ref_clk}]
# set_clock_latency -source -hold <board_min + 0.552> [get_ports {mipi_ref_clk}]
# set_clock_latency -source -setup <board_max + 1.907> [get_ports {pll_inst2_CLKOUT0}]
# set_clock_latency -source -hold <board_min + 1.271> [get_ports {pll_inst2_CLKOUT0}]


set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~229~1}] -max 0.263 [get_ports {fx3_ctl_11}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~229~1}] -min -0.140 [get_ports {fx3_ctl_11}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~113~642}] -max 0.263 [get_ports {fx3_ctl_12}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~113~642}] -min -0.140 [get_ports {fx3_ctl_12}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~280~1}] -max 0.263 [get_ports {fx3_dq[0]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~280~1}] -min -0.140 [get_ports {fx3_dq[0]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~253~1}] -max 0.263 [get_ports {fx3_dq[1]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~253~1}] -min -0.140 [get_ports {fx3_dq[1]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~246~1}] -max 0.263 [get_ports {fx3_dq[2]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~246~1}] -min -0.140 [get_ports {fx3_dq[2]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~316~1}] -max 0.263 [get_ports {fx3_dq[3]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~316~1}] -min -0.140 [get_ports {fx3_dq[3]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~262~1}] -max 0.263 [get_ports {fx3_dq[4]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~262~1}] -min -0.140 [get_ports {fx3_dq[4]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~271~1}] -max 0.263 [get_ports {fx3_dq[5]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~271~1}] -min -0.140 [get_ports {fx3_dq[5]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~290~1}] -max 0.263 [get_ports {fx3_dq[6]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~290~1}] -min -0.140 [get_ports {fx3_dq[6]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~254~1}] -max 0.263 [get_ports {fx3_dq[7]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~254~1}] -min -0.140 [get_ports {fx3_dq[7]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~315~1}] -max 0.263 [get_ports {fx3_dq[8]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~315~1}] -min -0.140 [get_ports {fx3_dq[8]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~289~1}] -max 0.263 [get_ports {fx3_dq[9]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~289~1}] -min -0.140 [get_ports {fx3_dq[9]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~263~1}] -max 0.263 [get_ports {fx3_dq[10]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~263~1}] -min -0.140 [get_ports {fx3_dq[10]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~281~1}] -max 0.263 [get_ports {fx3_dq[11]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~281~1}] -min -0.140 [get_ports {fx3_dq[11]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~324~1}] -max 0.263 [get_ports {fx3_dq[12]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~324~1}] -min -0.140 [get_ports {fx3_dq[12]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~325~1}] -max 0.263 [get_ports {fx3_dq[13]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~325~1}] -min -0.140 [get_ports {fx3_dq[13]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~237~1}] -max 0.263 [get_ports {fx3_dq[14]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~237~1}] -min -0.140 [get_ports {fx3_dq[14]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~272~1}] -max 0.263 [get_ports {fx3_dq[15]}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~272~1}] -min -0.140 [get_ports {fx3_dq[15]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {lcd_power_en}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {lcd_power_en}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led0}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~148~1}] -max 0.263 [get_ports {uvc_clk_LO uvc_clk_HI}]
set_output_delay -clock i_sysclk_div2 -reference_pin [get_ports {i_sysclk_div2~CLKOUT~148~1}] -min -0.140 [get_ports {uvc_clk_LO uvc_clk_HI}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_scl_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_scl_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_scl_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_scl_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_scl_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_scl_OE}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_sda_IN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_sda_IN}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_sda_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_sda_OUT}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {io_cam_sda_OE}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {io_cam_sda_OE}]

# LVDS Tx Constraints
#######################
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~590}] -max 0.378 [get_ports {tmds_clk_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~590}] -min -0.140 [get_ports {tmds_clk_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~590}] -max 0.378 [get_ports {tmds_clk_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~590}] -min -0.140 [get_ports {tmds_clk_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~554}] -max 0.378 [get_ports {tmds_data0_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~554}] -min -0.140 [get_ports {tmds_data0_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~554}] -max 0.378 [get_ports {tmds_data0_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~554}] -min -0.140 [get_ports {tmds_data0_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~566}] -max 0.378 [get_ports {tmds_data1_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~566}] -min -0.140 [get_ports {tmds_data1_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~566}] -max 0.378 [get_ports {tmds_data1_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~566}] -min -0.140 [get_ports {tmds_data1_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~577}] -max 0.378 [get_ports {tmds_data2_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~577}] -min -0.140 [get_ports {tmds_data2_TX_DATA[*]}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~577}] -max 0.378 [get_ports {tmds_data2_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~577}] -min -0.140 [get_ports {tmds_data2_TX_OE}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~590}] -max 0.420 [get_ports {tmds_clk_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~590}] -min -0.175 [get_ports {tmds_clk_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~554}] -max 0.420 [get_ports {tmds_data0_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~554}] -min -0.175 [get_ports {tmds_data0_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~566}] -max 0.420 [get_ports {tmds_data1_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~566}] -min -0.175 [get_ports {tmds_data1_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~577}] -max 0.420 [get_ports {tmds_data2_TX_RST}]
set_output_delay -clock hdmi_tx_slow_clk -reference_pin [get_ports {hdmi_tx_slow_clk~CLKOUT~333~577}] -min -0.175 [get_ports {tmds_data2_TX_RST}]
